In [1]:
import pandas as pd
import numpy as np

In [27]:
df = pd.read_csv('sample_hours_rate.csv'
                #  ,index_col='name'
                 )

In [17]:
pd.set_option('display.max_rows', 500)

In [18]:
pd.options.display.max_rows

500

In [28]:
df.size

30

In [29]:
df.shape

(10, 3)

In [30]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [31]:
df.head()

              name  hours    rate
0     Katell Bryan     50  $41.94
1  Addison Walters     45  $15.26
2       Veda Stein     36  $34.19
3     Jocelyn Shaw     36  $16.13
4   Shelley Waters     42  $37.78

In [32]:
df.tail()

               name  hours    rate
5  Arthur Frederick     23  $24.61
6    Hollee Stanley     41  $23.98
7     Brennan Avery     40  $39.47
8     Dacey Goodwin     15  $44.42
9     Karyn Harding     46  $49.01

In [35]:
df.set_index('name',inplace=True)

In [36]:
df.head()

                 hours    rate
name
Katell Bryan        50  $41.94
Addison Walters     45  $15.26
Veda Stein          36  $34.19
Jocelyn Shaw        36  $16.13
Shelley Waters      42  $37.78

In [37]:
df.dtypes

hours     int64
rate     object
dtype: object

In [39]:
df.reset_index(inplace=True)

In [40]:
df

               name  hours    rate
0      Katell Bryan     50  $41.94
1   Addison Walters     45  $15.26
2        Veda Stein     36  $34.19
3      Jocelyn Shaw     36  $16.13
4    Shelley Waters     42  $37.78
5  Arthur Frederick     23  $24.61
6    Hollee Stanley     41  $23.98
7     Brennan Avery     40  $39.47
8     Dacey Goodwin     15  $44.42
9     Karyn Harding     46  $49.01

In [41]:
df_numpy = df.to_numpy()
df_numpy

array([['Katell Bryan', 50, '$41.94'],
       ['Addison Walters', 45, '$15.26'],
       ['Veda Stein', 36, '$34.19'],
       ['Jocelyn Shaw', 36, '$16.13'],
       ['Shelley Waters', 42, '$37.78'],
       ['Arthur Frederick', 23, '$24.61'],
       ['Hollee Stanley', 41, '$23.98'],
       ['Brennan Avery', 40, '$39.47'],
       ['Dacey Goodwin', 15, '$44.42'],
       ['Karyn Harding', 46, '$49.01']], dtype=object)

In [48]:
df_numpy_hours = df_numpy[:,1]

In [52]:
df_numpy_hours

array([50, 45, 36, 36, 42, 23, 41, 40, 15, 46], dtype=object)

In [51]:
df_numpy_hours.mean()

np.float64(37.4)

In [53]:
df_numpy_rate = df_numpy[:,2]

In [57]:
df_numpy_rate[0][1:]

'41.94'

In [70]:
rate_list = []
for rate in df_numpy_rate:
    # print(rate[1:])
    rate_list.append(float(rate[1:]))
rate_list

TypeError: 'float' object is not subscriptable

In [66]:
df_numpy_rate_array = np.array([float(rate[1:]) for rate in df_numpy_rate ])
df_numpy_rate_array

array([41.94, 15.26, 34.19, 16.13, 37.78, 24.61, 23.98, 39.47, 44.42,
       49.01])

In [67]:
df_numpy[:,2] = df_numpy_rate_array

In [68]:
df_numpy

array([['Katell Bryan', 50, 41.94],
       ['Addison Walters', 45, 15.26],
       ['Veda Stein', 36, 34.19],
       ['Jocelyn Shaw', 36, 16.13],
       ['Shelley Waters', 42, 37.78],
       ['Arthur Frederick', 23, 24.61],
       ['Hollee Stanley', 41, 23.98],
       ['Brennan Avery', 40, 39.47],
       ['Dacey Goodwin', 15, 44.42],
       ['Karyn Harding', 46, 49.01]], dtype=object)

In [69]:
df_numpy_rate.mean()

np.float64(32.678999999999995)